tutorial/modifiedMeshMorphing/mooringCase-H12T20-MMM/mooredFloatingObject/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    libfiniteVolumeBeamMooring.so
    libsixDoFRigidBodyStateFvBeam.so
	//libmyScotchDecomp.so
	libwireBunchingModels.so
);


application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         16;

deltaT          0.001;

writeControl    adjustableRunTime; // timeStep; //

writeInterval   0.5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.25;
maxDeltaT       0.01;

functions
{
//    sixDoF_History
//    {
//        type           sixDoFRigidBodyStateFvBeam;
//        libs           ("libsixDoFRigidBodyStateFvBeam.so");
//        angleFormat    radians;//radians, degrees
//
//        writeControl   timeStep;
//        writeInterval  1;
//  }
//
//     interfaceHeight1
//     {
//      	type            interfaceHeight;
//
//        libs            ("libfieldFunctionObjects.so");
//	direction	(0 0 1);
//        locations       ((-2.740001 0.0001 0) (-0.050001 0.0001 0) (0.070001 0.0001 0) (0.550001 0.0001 0) (1.90001 0.0001 0) (2.90001 0.0001 0));
//        alpha           alpha.water;
//
//        writeControl   timeStep;
//        writeInterval  1; 
//     }
}

// ************************************************************************* //
