tutorial/modifiedMeshMorphing/mooringCase-H12T20-MMM/mooredFloatingObject/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontWall
    {
        type            fixedNormalSlip;//fixedValue;
        n		(0 1 0);
    }
    backWall
    {
        type            fixedNormalSlip;//fixedValue;
        n		(0 -1 0);
    }
    bottomWall
    {
        type            fixedNormalSlip;//fixedValue;
        n		(0 0 1);
	//value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            fixedNormalSlip;//fixedValue;
        n		(0 0 -1);
	//value           uniform (0 0 0);
    }
    sides
    {
        type            empty;
    }
    floatingObject
    {
        type            calculated;
    }
}


// ************************************************************************* //
